{
  "quizType": "likert",
  "meta": {
    "id": "emotional-intelligence",
    "slug": "emotional-intelligence",
    "title": "How Emotionally Intelligent Is Your Child?",
    "shortTitle": "Emotional Intelligence",
    "description": "See where your child shines emotionally and where they're still building skills. A profile across four dimensions of emotional development for kids ages 3-10.",
    "intro": "Rate each statement based on what your child typically does — not their best day or their worst. There are no bad scores, just a clearer picture.",
    "estimatedTime": "3 minutes",
    "questionCount": 20,
    "scoreLabel": "EQ Profile",
    "subject": "your child",
    "shareCta": "See your child's emotional intelligence profile — take the quiz",
    "ageRange": { "min": 3, "max": 10, "unit": "years" },
    "sources": [
      "Salovey-Mayer emotional intelligence model",
      "Gottman emotion coaching research",
      "CASEL social-emotional learning framework"
    ],
    "previewCta": {
      "eyebrow": "Want the full breakdown?",
      "title": "Get your child's complete emotional intelligence profile",
      "body": "See how your child scores across all four dimensions, what their strengths look like in practice, and where a small shift could make the biggest difference.",
      "buttonText": "Send my child's profile"
    },
    "previewPromises": [
      "How your child scores across all four EQ dimensions",
      "Concrete strengths you can actually see in daily life",
      "Their growth edge — one area where a small shift changes the most",
      "How their dimensions compare to each other",
      "A shareable snapshot of their emotional profile"
    ],
    "communityCta": {
      "eyebrow": "Feelings are a skill set, not a personality trait",
      "title": "Get real strategies for building emotional intelligence at every age",
      "body": "When your kid melts down because the blue cup is dirty, or freezes instead of saying what's wrong — you need something more specific than 'validate their feelings.' That's what the community is for.",
      "buttonText": "Join for $7/month"
    }
  },
  "scale": {
    "labels": ["Never", "Rarely", "Sometimes", "Often", "Always"],
    "points": [1, 2, 3, 4, 5]
  },
  "dimensions": {
    "emotion-vocabulary": {
      "id": "emotion-vocabulary",
      "name": "Emotion Vocabulary",
      "themeColor": "#3b82f6",
      "tagline": "Your child has words for what's happening inside — not just 'fine' and 'mad.'",
      "description": "Your child can name what they're feeling with more precision than most adults at a dinner party. They distinguish between frustrated and disappointed, nervous and scared. When emotions hit, they reach for language instead of just volume.",
      "strengths": [
        "Uses specific feeling words instead of defaulting to 'fine' or 'bad'",
        "Can describe what made them feel a certain way, not just that they feel it",
        "Recognizes emotions in others based on facial expressions and tone"
      ],
      "growthEdge": "Having the words doesn't always mean using them in the moment. When the emotional temperature spikes, the vocabulary tends to shrink back to grunting and door-slamming.",
      "encouragement": "A child who can name their feelings is already doing something most adults struggle with. This foundation makes every other emotional skill easier to build — regulation, empathy, conflict resolution all start here.",
      "comparativeContext": "Research finds that children who can label emotions accurately show measurably better social skills and fewer behavior problems by school age."
    },
    "self-regulation": {
      "id": "self-regulation",
      "name": "Self-Regulation",
      "themeColor": "#10b981",
      "tagline": "Your child can feel the big feeling without becoming the big feeling.",
      "description": "Your child has strategies — however clumsy — for managing emotions that would otherwise run the show. They might take deep breaths, walk away, squeeze a pillow, or ask for help. The meltdowns still happen, but there's a growing gap between feeling the emotion and acting on it.",
      "strengths": [
        "Uses calming strategies without always needing a parent to initiate them",
        "Can recover from disappointment or frustration without the whole day unraveling",
        "Shows increasing ability to wait, pause, or redirect when upset"
      ],
      "growthEdge": "Self-regulation is the first skill to bail when a child is tired, hungry, or overstimulated. The strategies work until they don't — and that's normal, not a failure.",
      "encouragement": "Every time your child pauses instead of exploding — even once — that's a neural pathway getting stronger. Self-regulation isn't about never losing it. It's about the recovery time getting shorter. That's real, measurable progress.",
      "comparativeContext": "Studies show self-regulation develops gradually through age 10, with the biggest gains happening between ages 4 and 7 when the prefrontal cortex is rapidly maturing."
    },
    "empathy": {
      "id": "empathy",
      "name": "Empathy",
      "themeColor": "#f43f5e",
      "tagline": "Your child notices when someone else is having a hard time — and actually cares.",
      "description": "Your child picks up on other people's emotions and responds with something beyond 'not my problem.' They notice the sad kid at the playground, offer comfort to a crying sibling, or get visibly uncomfortable when someone is being treated unfairly. It's not performance — they genuinely feel it.",
      "strengths": [
        "Notices emotional shifts in others without being told to look",
        "Offers comfort or help spontaneously, not just when prompted",
        "Shows concern for fairness and gets bothered when things aren't right"
      ],
      "growthEdge": "Empathy without boundaries turns into absorbing everyone else's emotions. Your child may need help distinguishing between 'I care about your feelings' and 'your feelings are now my problem to fix.'",
      "encouragement": "A child who notices and responds to others' pain is building the foundation for every meaningful relationship they'll ever have. Empathy isn't softness — it's social intelligence. The kids who have it navigate friendships, conflict, and collaboration better than their peers.",
      "comparativeContext": "Research shows empathic responding is present from toddlerhood but becomes more sophisticated and consistent between ages 4 and 8."
    },
    "frustration-tolerance": {
      "id": "frustration-tolerance",
      "name": "Frustration Tolerance",
      "themeColor": "#f59e0b",
      "tagline": "Your child can handle things not going their way without the world ending.",
      "description": "Your child encounters setbacks — losing a game, getting the wrong color cup, waiting longer than expected — and manages to not completely come apart. They might grumble, they might huff, but they keep going. The frustration doesn't become a full-system shutdown.",
      "strengths": [
        "Can lose a game or miss a turn without a full emotional collapse",
        "Handles waiting and delays with visible effort but reasonable success",
        "Tries again after making a mistake instead of quitting immediately"
      ],
      "growthEdge": "Frustration tolerance is highly context-dependent. Your child might handle losing at soccer like a champ and completely fall apart over a Lego piece that won't fit. That inconsistency is normal — not backsliding.",
      "encouragement": "Every time your child pushes through frustration instead of quitting, they're building a skill that predicts academic success, relationship quality, and career outcomes better than IQ does. The grit is real, even when it doesn't look graceful.",
      "comparativeContext": "Frustration tolerance is one of the strongest predictors of school readiness, with research linking it to both academic performance and peer relationships."
    }
  },
  "statements": [
    { "id": "s1", "text": "My child uses specific words for their emotions beyond just 'happy,' 'sad,' or 'mad.'", "dimension": "emotion-vocabulary" },
    { "id": "s2", "text": "My child can calm themselves down after getting upset without my help.", "dimension": "self-regulation" },
    { "id": "s3", "text": "My child notices when another child is sad or upset.", "dimension": "empathy" },
    { "id": "s4", "text": "My child can handle losing a game without a meltdown.", "dimension": "frustration-tolerance" },
    { "id": "s5", "text": "My child can explain what made them feel a certain way.", "dimension": "emotion-vocabulary" },
    { "id": "s6", "text": "My child tries to comfort someone who is crying or hurt.", "dimension": "empathy" },
    { "id": "s7", "text": "My child uses a strategy to manage big feelings (deep breaths, walking away, squeezing something).", "dimension": "self-regulation" },
    { "id": "s8", "text": "My child keeps trying after making a mistake instead of giving up.", "dimension": "frustration-tolerance" },
    { "id": "s9", "text": "My child can tell the difference between feeling nervous and feeling angry.", "dimension": "emotion-vocabulary" },
    { "id": "s10", "text": "My child waits for their turn without falling apart.", "dimension": "frustration-tolerance" },
    { "id": "s11", "text": "My child stops what they're doing to check on someone who seems upset.", "dimension": "empathy" },
    { "id": "s12", "text": "My child can recover from a disappointment and move on with their day.", "dimension": "self-regulation" },
    { "id": "s13", "text": "My child names the feeling they're having when upset, without being asked.", "dimension": "emotion-vocabulary" },
    { "id": "s14", "text": "My child handles unexpected changes to plans without a major reaction.", "dimension": "frustration-tolerance" },
    { "id": "s15", "text": "My child adjusts their behavior when they see someone is bothered by it.", "dimension": "empathy" },
    { "id": "s16", "text": "My child asks for help managing their emotions instead of just escalating.", "dimension": "self-regulation" },
    { "id": "s17", "text": "My child talks about characters' feelings when reading books or watching shows.", "dimension": "emotion-vocabulary" },
    { "id": "s18", "text": "My child sticks with a difficult task even when it's frustrating.", "dimension": "frustration-tolerance" },
    { "id": "s19", "text": "My child expresses concern about fairness when someone is being treated badly.", "dimension": "empathy" },
    { "id": "s20", "text": "My child can pause and think before reacting when something upsets them.", "dimension": "self-regulation" }
  ]
}
