{
  "quizType": "likert",
  "meta": {
    "id": "parenting-style",
    "slug": "parenting-style",
    "title": "What's Your Parenting Style?",
    "shortTitle": "Parenting Style Quiz",
    "description": "Discover your dominant parenting style based on validated parenting research. Rate 18 everyday behaviors to see your unique blend of Steady Guide, Firm Protector, and Free Spirit.",
    "intro": "Rate how often you do each of these 18 parenting behaviors. Your results show which style drives most of your decisions — and where you might be overcompensating.",
    "estimatedTime": "3 minutes",
    "questionCount": 18,
    "scoreLabel": "Style",
    "subject": "you",
    "shareCta": "Curious what your parenting style is? Find out in 3 minutes.",
    "sources": [
      "Baumrind parenting typology",
      "Maccoby & Martin framework",
      "PSDQ (Parenting Styles and Dimensions Questionnaire)"
    ],
    "previewCta": {
      "eyebrow": "Want the full breakdown?",
      "title": "Get your complete parenting style profile",
      "body": "See your primary style, detailed dimension descriptions, your unique strengths, growth edges, and how all three styles compare in your profile.",
      "buttonText": "Send my profile"
    },
    "previewPromises": [
      "Your primary parenting style and what it looks like in daily life",
      "How all three dimensions compare in your profile",
      "Strengths specific to your dominant style",
      "Your growth edge — the one shift that changes the most",
      "How your blend compares to other parents"
    ],
    "communityCta": {
      "eyebrow": "Now what?",
      "title": "Get strategies matched to your style",
      "body": "Bite-sized scripts, real-talk explanations, and a private group of parents figuring out the same stuff you are.",
      "buttonText": "Join the community"
    }
  },
  "scale": {
    "labels": ["Never", "Rarely", "Sometimes", "Often", "Always"],
    "points": [1, 2, 3, 4, 5]
  },
  "dimensions": {
    "steady-guide": {
      "id": "steady-guide",
      "name": "The Steady Guide",
      "themeColor": "#00b86b",
      "tagline": "You explain the why, hold the line, and somehow keep your voice level at bedtime.",
      "description": "You parent like someone who actually read the manual and then rewrote the parts that didn't make sense. You set clear expectations but you also listen — genuinely listen, not the performative nodding kind. Your kids know the rules AND the reasoning behind them, which means they argue with you using your own logic.",
      "strengths": [
        "You give reasons for your rules, which builds critical thinking even when it's exhausting",
        "You adjust your approach when something isn't working instead of doubling down",
        "You validate feelings without caving on boundaries — the parenting tightrope walk"
      ],
      "growthEdge": "You can over-explain. Sometimes a kid needs a firm \"because I said so\" more than a TED Talk on natural consequences. Not every moment requires a teaching opportunity.",
      "encouragement": "Research consistently links this style to kids who are self-regulated, socially competent, and academically resilient. That doesn't mean your house isn't chaos — it means the chaos has a foundation. Keep trusting the process even on days when it looks like it's not working.",
      "comparativeContext": "Studies find that roughly 35-40% of parents in Western cultures lean primarily toward this balanced, reasoning-based approach."
    },
    "firm-protector": {
      "id": "firm-protector",
      "name": "The Firm Protector",
      "themeColor": "#e07937",
      "tagline": "Your house has rules, your kids know them, and bedtime is not a negotiation.",
      "description": "You believe structure IS love, and frankly, you're not wrong. Your kids don't wonder what's expected of them because you've made it crystal clear. You're the parent who follows through on consequences even when it would be easier to let it slide — because you know that consistency now saves everyone grief later.",
      "strengths": [
        "You follow through on consequences consistently, which builds genuine security",
        "You set clear expectations so your kids aren't guessing at the rules",
        "You provide predictable routines that help anxious or spirited kids feel safe"
      ],
      "growthEdge": "Consistency is your superpower, but rigidity is its shadow. When your kid pushes back, check whether they need compliance or to be heard. One conversation won't unravel your authority.",
      "encouragement": "Your kids have structure, and structure is genuinely protective. The research is clear that children with consistent boundaries feel safer and develop better self-regulation. The next level for you isn't less firmness — it's adding more warmth to the firmness you already have.",
      "comparativeContext": "About 25-30% of parents primarily use a structure-first approach, and it's especially common in families that value respect and responsibility."
    },
    "free-spirit": {
      "id": "free-spirit",
      "name": "The Free Spirit",
      "themeColor": "#9c83f2",
      "tagline": "You'd rather say yes than no, and your kids have opinions about everything.",
      "description": "You prioritize your child's experience, autonomy, and emotional world — sometimes at the expense of your own sanity. You're the parent who lets them wear the costume to the grocery store, who negotiates bedtime like it's a peace treaty, and who genuinely believes kids deserve a voice. Your home is warm, creative, and occasionally a little lawless.",
      "strengths": [
        "You create an environment where your kids feel safe to express anything",
        "You prioritize emotional connection, which builds secure attachment",
        "You encourage independence and creative thinking by defaulting to yes"
      ],
      "growthEdge": "Saying yes to everything means your kid doesn't know where the edges are. They need guardrails — not to limit them, but so they have something solid to push against when the world gets overwhelming.",
      "encouragement": "Your kids know they're loved and that their feelings matter. That's not small. Research shows warm, responsive parenting predicts secure attachment and emotional intelligence. The growth isn't becoming stricter — it's getting comfortable with the discomfort of holding a boundary when your kid is upset about it.",
      "comparativeContext": "Roughly 20-25% of parents lean primarily toward a freedom-first, connection-driven style."
    }
  },
  "statements": [
    {
      "id": "s1",
      "text": "I explain the reasons behind my rules to my child.",
      "dimension": "steady-guide"
    },
    {
      "id": "s2",
      "text": "I enforce consequences even when my child gets upset about them.",
      "dimension": "firm-protector"
    },
    {
      "id": "s3",
      "text": "I let my child choose how to spend their free time without much direction.",
      "dimension": "free-spirit"
    },
    {
      "id": "s4",
      "text": "I give in to my child to avoid a meltdown in public.",
      "dimension": "firm-protector",
      "reversed": true
    },
    {
      "id": "s5",
      "text": "I adjust my parenting approach when I can see it's not working.",
      "dimension": "steady-guide"
    },
    {
      "id": "s6",
      "text": "I stick to the same bedtime routine regardless of what my child wants.",
      "dimension": "firm-protector"
    },
    {
      "id": "s7",
      "text": "I let my child eat what they want rather than battle over food.",
      "dimension": "free-spirit"
    },
    {
      "id": "s8",
      "text": "I acknowledge my child's feelings before redirecting their behavior.",
      "dimension": "steady-guide"
    },
    {
      "id": "s9",
      "text": "I follow through on what I said would happen, even when it's inconvenient.",
      "dimension": "firm-protector"
    },
    {
      "id": "s10",
      "text": "I negotiate rules with my child instead of just setting them.",
      "dimension": "free-spirit"
    },
    {
      "id": "s11",
      "text": "I lose my temper and yell to get my child to listen.",
      "dimension": "steady-guide",
      "reversed": true
    },
    {
      "id": "s12",
      "text": "I let my child stay up late if they're having a good time.",
      "dimension": "free-spirit"
    },
    {
      "id": "s13",
      "text": "I involve my child in making family decisions that affect them.",
      "dimension": "steady-guide"
    },
    {
      "id": "s14",
      "text": "I set clear expectations before we enter a new situation.",
      "dimension": "firm-protector"
    },
    {
      "id": "s15",
      "text": "I drop everything to comfort my child even when they're overreacting.",
      "dimension": "free-spirit"
    },
    {
      "id": "s16",
      "text": "I listen to my child's side of things before deciding on a consequence.",
      "dimension": "steady-guide"
    },
    {
      "id": "s17",
      "text": "I have non-negotiable household rules that everyone follows.",
      "dimension": "firm-protector"
    },
    {
      "id": "s18",
      "text": "I threaten consequences I know I won't follow through on.",
      "dimension": "free-spirit",
      "reversed": true
    }
  ]
}
