{
  "quizType": "likert",
  "meta": {
    "id": "parenting-style",
    "slug": "parenting-style",
    "title": "What's Your Parenting Style?",
    "shortTitle": "Parenting Style Quiz",
    "description": "Discover your primary parenting approach based on validated parenting style research. Rate how often each behavior applies to you across four dimensions to see your unique blend.",
    "intro": "Rate how often you do each of these 20 parenting behaviors. No right answers — just an honest look at which style drives most of your decisions.",
    "estimatedTime": "3 minutes",
    "questionCount": 20,
    "scoreLabel": "Style",
    "subject": "you",
    "shareCta": "Curious what your parenting style is? Find out in 3 minutes.",
    "sources": [
      "Baumrind parenting typology",
      "Maccoby & Martin four-style framework",
      "PSDQ (Parenting Styles and Dimensions Questionnaire)"
    ],
    "previewCta": {
      "eyebrow": "Want the full breakdown?",
      "title": "Get your complete parenting style profile across all four dimensions",
      "body": "See which dimension leads your profile, how all four styles compare in your blend, your specific strengths, and the growth edge that would shift the most for you.",
      "buttonText": "Send my results"
    },
    "previewPromises": [
      "Your primary parenting style and what it looks like day-to-day",
      "How all four dimensions compare in your profile",
      "Concrete strengths specific to your dominant style",
      "Your growth edge — the one shift that changes the most",
      "How your blend compares to other parents"
    ],
    "communityCta": {
      "eyebrow": "Beyond the profile",
      "title": "Get parenting scripts matched to your style",
      "body": "A private group with bite-sized scripts and long-form explanations from parents figuring it out. We are there with you daily too.",
      "buttonText": "Join the community"
    }
  },
  "scale": {
    "labels": ["Never", "Rarely", "Sometimes", "Often", "Always"],
    "points": [1, 2, 3, 4, 5]
  },
  "dimensions": {
    "steady-guide": {
      "id": "steady-guide",
      "name": "Steady Guide",
      "themeColor": "#00b86b",
      "tagline": "You explain the why, hold the line, and somehow keep your voice level at bedtime.",
      "description": "You parent with a blend of warmth and structure that researchers call authoritative but you call Tuesday. You set clear expectations and then actually explain the reasoning. Your kids know the rules and the logic behind them, which means they argue using your own words back at you.",
      "strengths": [
        "You give reasons for your rules, building critical thinking even when it is exhausting",
        "You adjust your approach when something clearly is not working instead of doubling down",
        "You validate feelings without caving on boundaries — the hardest tightrope in parenting"
      ],
      "growthEdge": "You can over-explain. Sometimes a kid needs a firm no more than a ten-minute seminar on natural consequences. Not every moment needs to be a teaching opportunity.",
      "encouragement": "Research consistently links this approach to children who are self-regulated, socially competent, and academically resilient. That does not mean your house is calm — it means the chaos has a foundation. Keep trusting the process on the days it looks like nothing is working.",
      "comparativeContext": "Studies find roughly 35-40% of parents in Western cultures lean primarily toward this balanced, reasoning-based approach.",
      "populationNorm": { "mean": 3.9, "sd": 0.55 }
    },
    "firm-protector": {
      "id": "firm-protector",
      "name": "Firm Protector",
      "themeColor": "#e07937",
      "tagline": "Your house has rules, your kids know them, and bedtime is not a negotiation.",
      "description": "You believe structure is love, and you are not wrong. Your kids never wonder what is expected because you have made it unmistakably clear. You follow through on consequences even when it would be easier to let it slide, because you know that consistency now saves everyone grief later.",
      "strengths": [
        "You follow through on consequences consistently, which builds genuine security",
        "You set clear expectations so your kids are never guessing at the rules",
        "You provide predictable routines that help anxious or spirited kids feel safe"
      ],
      "growthEdge": "Consistency is your superpower, but rigidity is its shadow. When your kid pushes back, check whether they need compliance or to feel heard. One conversation will not unravel your authority.",
      "encouragement": "Your kids have structure, and structure is genuinely protective. Children with consistent boundaries feel safer and develop better self-regulation. The next step for you is not less firmness — it is adding more warmth alongside the firmness you already have.",
      "comparativeContext": "About 25-30% of parents primarily use a structure-first approach, especially common in families that value respect and responsibility.",
      "populationNorm": { "mean": 3.4, "sd": 0.60 }
    },
    "gentle-connector": {
      "id": "gentle-connector",
      "name": "Gentle Connector",
      "themeColor": "#9c83f2",
      "tagline": "You would rather say yes than no, and your kids feel safe telling you anything.",
      "description": "You prioritize your child's emotional world, autonomy, and sense of being heard — sometimes at the expense of your own sanity. You negotiate bedtime like a peace treaty and genuinely believe kids deserve a voice in decisions that affect them. Your home is warm, expressive, and occasionally a little lawless.",
      "strengths": [
        "You create an environment where your kids feel safe to express anything without judgment",
        "You prioritize emotional connection, which builds secure attachment from the ground up",
        "You encourage independence and creative thinking by defaulting to yes when possible"
      ],
      "growthEdge": "Saying yes to everything means your kid does not know where the edges are. They need guardrails — not to limit them, but so they have something solid to push against when the world gets overwhelming.",
      "encouragement": "Your kids know they are loved and that their feelings matter. That is not small. Warm, responsive parenting predicts secure attachment and emotional intelligence. The growth is not becoming stricter — it is getting comfortable with the discomfort of holding a boundary when your child is upset about it.",
      "comparativeContext": "Roughly 20-25% of parents lean primarily toward a connection-driven, flexibility-first style.",
      "populationNorm": { "mean": 2.7, "sd": 0.65 }
    },
    "free-range-navigator": {
      "id": "free-range-navigator",
      "name": "Free-Range Navigator",
      "themeColor": "#3b82f6",
      "tagline": "You trust your kid to figure things out, and they are more capable than most people expect.",
      "description": "You give your child significant autonomy because you genuinely believe kids learn best through their own experience — scraped knees, bad choices, and all. You are not absent; you are strategically hands-off. You step in for safety, but you resist the urge to micromanage every social interaction and homework assignment.",
      "strengths": [
        "You foster genuine independence by resisting the urge to hover and fix everything",
        "You trust your child's ability to solve their own problems, which builds real confidence",
        "You model calm under pressure by not treating every childhood setback as an emergency"
      ],
      "growthEdge": "There is a line between healthy independence and a kid who stops asking for help. Check in more often than you think you need to — not to control, but to connect.",
      "encouragement": "Your kids are building problem-solving skills and resilience that helicopter-parented children often lack. Independence is a genuine gift. The calibration is making sure your child knows the door is always open, even if they rarely knock on it.",
      "comparativeContext": "About 15-20% of parents lean primarily toward an autonomy-first approach, though it is more common among parents of older children and teens.",
      "populationNorm": { "mean": 2.8, "sd": 0.70 }
    }
  },
  "statements": [
    {
      "id": "s1",
      "text": "I explain the reasons behind my rules to my child.",
      "dimension": "steady-guide"
    },
    {
      "id": "s2",
      "text": "I enforce consequences even when my child gets upset about them.",
      "dimension": "firm-protector"
    },
    {
      "id": "s3",
      "text": "I let my child work through a conflict with another kid before stepping in.",
      "dimension": "free-range-navigator"
    },
    {
      "id": "s4",
      "text": "I give in to my child to avoid a meltdown in public.",
      "dimension": "firm-protector",
      "reversed": true
    },
    {
      "id": "s5",
      "text": "I drop what I am doing to comfort my child even when they are overreacting.",
      "dimension": "gentle-connector"
    },
    {
      "id": "s6",
      "text": "I adjust my parenting approach when I can see it is not working.",
      "dimension": "steady-guide"
    },
    {
      "id": "s7",
      "text": "I let my child handle disappointments on their own without rushing to fix things.",
      "dimension": "free-range-navigator"
    },
    {
      "id": "s8",
      "text": "I stick to the same bedtime routine regardless of what my child wants.",
      "dimension": "firm-protector"
    },
    {
      "id": "s9",
      "text": "I negotiate rules with my child instead of just setting them.",
      "dimension": "gentle-connector"
    },
    {
      "id": "s10",
      "text": "I acknowledge my child's feelings before redirecting their behavior.",
      "dimension": "steady-guide"
    },
    {
      "id": "s11",
      "text": "I raise my voice to get my child to listen.",
      "dimension": "steady-guide",
      "reversed": true
    },
    {
      "id": "s12",
      "text": "I let my child decide how to spend their weekend without much input from me.",
      "dimension": "free-range-navigator"
    },
    {
      "id": "s13",
      "text": "I let my child stay up late if they are having a good time.",
      "dimension": "gentle-connector"
    },
    {
      "id": "s14",
      "text": "I set clear expectations before we enter a new situation.",
      "dimension": "firm-protector"
    },
    {
      "id": "s15",
      "text": "I involve my child in making family decisions that affect them.",
      "dimension": "steady-guide"
    },
    {
      "id": "s16",
      "text": "I let my child eat whatever they want rather than battle over food.",
      "dimension": "gentle-connector"
    },
    {
      "id": "s17",
      "text": "I have non-negotiable household rules that everyone follows.",
      "dimension": "firm-protector"
    },
    {
      "id": "s18",
      "text": "I hover over my child during playdates to make sure nothing goes wrong.",
      "dimension": "free-range-navigator",
      "reversed": true
    },
    {
      "id": "s19",
      "text": "I let my child walk to a nearby friend's house without an adult.",
      "dimension": "free-range-navigator"
    },
    {
      "id": "s20",
      "text": "I threaten consequences I know I will not follow through on.",
      "dimension": "gentle-connector",
      "reversed": true
    }
  ]
}
